examples/eulerian_module_examples/E0_communication_test/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  | Author: 2023, by Flavio A. C. Martins f.m.martins@tudelft.nl
\*---------------------------------------------------------------------------*/



FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "./meshing/cylinder.stl"

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

minCellSize         0.025;  // =================

maxCellSize         0.025; // =================

boundaryCellSize    0.025; // =================


renameBoundary
{
    defaultType     patch;

    newPatchNames
    {
        "domain" { newName numericalBoundary; type  patch; }
        
    }
}

// ************************************************************************* //
