examples/eulerian_module_examples/E0_communication_test/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolver    solidBody;

solidBodyMotionFunction  linearMotion;


// ------Use only for linear motion
velocity (2 0 0); 


// // -------Use only for rotation
// rotatingMotionCoeffs
//   {
//     origin        ($_x_origin $_y_origin 0);
//     axis          (0 0 1);
//   }
//     omega         $_omega_rotation; // rad/s


// // ---------- Use only for liner oscillation
// solidBodyMotionFunction oscillatingLinearMotion;
// oscillatingLinearMotionCoeffs
//   {
//     amplitude     ($_x_amplitude_oscillating $_y_amplitude_oscillating 0);     //meters
//     omega         $_omega_oscillating_linear;                 //rad/s
//   }

// -------Use only with multiMotion

// rotation
// {
//   solidBodyMotionFunction rotatingMotion;
//   rotatingMotionCoeffs
//     {
//       origin        ($_x_origin $_y_origin 0);
//       axis          (0 0 1);
//       omega         $_omega_rotation; // rad/s
//     }
// }

// linear_oscillation
// {
//   solidBodyMotionFunction oscillatingLinearMotion;
//   oscillatingLinearMotionCoeffs
//     {
//       amplitude     ($_x_amplitude_oscillating $_y_amplitude_oscillating 0);     //meters
//       omega         $_omega_oscillating_linear;                 //rad/s
//     }
// }

translation
{
      solidBodyMotionFunction linearMotion;
      linearMotionCoeffs
      {
            velocity (0 0 0);   
      }
}






// ************************************************************************* //
